LorenzoBela/Ard-IDE/8_Controller_ESP32_Hotspot_FastGeo/ProxyClient.cpp
/**
 * ProxyClient.cpp — HTTP communication with the LilyGO proxy
 *
 * Rules enforced:
 *   - WiFi reconnect with exponential backoff (Article 2.4)
 *   - char[] buffers for JSON payloads (Article 2.2)
 *   - No delay() in any function callable from loop() (Article 2.1)
 */

#include "ProxyClient.h"
#include <esp_wifi.h>
#include <HTTPClient.h>
#include <WiFi.h>
#include <WiFiUdp.h>

#ifndef DISABLE_PROXY_UART
#define DISABLE_PROXY_UART 0
#endif

#ifndef DISABLE_PROXY_KEEPALIVE
#define DISABLE_PROXY_KEEPALIVE 0
#endif

#ifndef PROXY_UART_TIMEOUT_MS
#define PROXY_UART_TIMEOUT_MS 300
#endif

// ── Box identity (populated by scanForProxy()) ──
char WIFI_SSID[33]     = "";
char WIFI_PASSWORD[65] = "";
char HARDWARE_ID[12]   = "";
char PROXY_HOST[16]    = "";

// ── UDP logger ──
static WiFiUDP udpClient;
static HardwareSerial proxySerial(1);
static bool proxyUartStarted = false;
static SemaphoreHandle_t proxyUartMutex = NULL;
static uint16_t proxyRequestId = 1;
static unsigned long proxyUartRetryAt = 0;
static uint8_t proxyUartFailCount = 0;
static uint8_t proxyUartResetCount = 0;

// ── Delivery context ──
char  currentOtp[8]          = "";
char  activeDeliveryId[64]   = "";
bool  hasActiveDelivery      = false;
String lastStatusCommand     = "";
int16_t geoDistMeters        = -1;
bool    geoInsideFence       = false;
bool    isReturning          = false;
char    deliveryPhase[12]    = "NONE";
bool    pickupInsideFence    = false;
bool    dropoffInsideFence   = false;

// ── WiFi backoff state ──
static unsigned long wifiRetryAt    = 0;
static unsigned long wifiBackoffMs  = WIFI_RETRY_BASE_MS;
static unsigned long wifiRescanAt   = 0;
static unsigned long wifiConnectStartedAt = 0;
static uint8_t wifiReconnectAttempts = 0;
static uint8_t proxyBssid[6] = {0};
static bool proxyBssidKnown = false;
static int32_t proxyChannel = 0;
static uint8_t hotspotScanStart = 0;
static int8_t selectedHotspotCredential = -1;
static unsigned long nextProxyDiscoveryAt = 0;
static unsigned long nextProxySubnetProbeAt = 0;
static unsigned long proxyMissingReconnectAt = 0;
static uint8_t proxyDiscoveryMisses = 0;
static uint8_t subnetProbeHost = 2;

static void clearDiscoveredProxy(const char *reason) {
  if (PROXY_HOST[0] != '\0') {
    Serial.printf("[DISCOVERY] Clearing proxy %s (%s)\n",
                  PROXY_HOST, reason ? reason : "unknown");
  }
  PROXY_HOST[0] = '\0';
  nextProxyDiscoveryAt = 0;
}

static void rememberDiscoveredProxy(const IPAddress &ip, const char *hardwareId,
                                    const char *source) {
  String ipStr = ip.toString();
  strncpy(PROXY_HOST, ipStr.c_str(), sizeof(PROXY_HOST) - 1);
  PROXY_HOST[sizeof(PROXY_HOST) - 1] = '\0';
  if (hardwareId && hardwareId[0] != '\0') {
    strncpy(HARDWARE_ID, hardwareId, sizeof(HARDWARE_ID) - 1);
    HARDWARE_ID[sizeof(HARDWARE_ID) - 1] = '\0';
  } else if (HARDWARE_ID[0] == '\0') {
    snprintf(HARDWARE_ID, sizeof(HARDWARE_ID), "BOX_001");
  }
  proxyDiscoveryMisses = 0;
  nextProxyDiscoveryAt = millis() + 5000UL;
  nextProxySubnetProbeAt = millis() + 15000UL;
  proxyMissingReconnectAt = 0;
  Serial.printf("[DISCOVERY] Proxy at %s:%d via %s\n",
                PROXY_HOST, PROXY_PORT, source ? source : "probe");
}

static bool pingProxyAt(const IPAddress &ip, unsigned long timeoutMs) {
  WiFiClient client;
  client.setTimeout(1);
  bool connected = false;
#if defined(ESP_ARDUINO_VERSION_MAJOR)
  connected = client.connect(ip, PROXY_PORT, (int32_t)timeoutMs);
#else
  connected = client.connect(ip, PROXY_PORT);
#endif
  if (!connected) {
    client.stop();
    return false;
  }

  client.printf(
      "GET /ping HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "Connection: close\r\n"
      "\r\n",
      ip.toString().c_str(), PROXY_PORT);

  unsigned long deadline = millis() + timeoutMs;
  bool sawHttpOk = false;
  bool sawBodyOk = false;
  while (millis() < deadline && (client.connected() || client.available())) {
    if (!client.available()) {
      yield();
      continue;
    }
    String line = client.readStringUntil('\n');
    line.trim();
    if (line.startsWith("HTTP/1.1 200") || line.startsWith("HTTP/1.0 200")) {
      sawHttpOk = true;
    }
    if (line == "OK") {
      sawBodyOk = true;
      break;
    }
  }
  client.stop();
  return sawHttpOk || sawBodyOk;
}

static bool tryProxyCandidate(const IPAddress &ip, const char *source,
                              unsigned long timeoutMs = 180) {
  if (ip == IPAddress(0, 0, 0, 0) || ip == WiFi.localIP()) return false;
  if (pingProxyAt(ip, timeoutMs)) {
    rememberDiscoveredProxy(ip, NULL, source);
    return true;
  }
  return false;
}

static bool probeLikelyProxyHosts(uint8_t maxHosts = 6) {
  if (WiFi.status() != WL_CONNECTED) return false;

  IPAddress gateway = WiFi.gatewayIP();
  if (tryProxyCandidate(gateway, "gateway")) return true;

  IPAddress local = WiFi.localIP();

  uint8_t tried = 0;
  while (tried < maxHosts) {
    if (subnetProbeHost == 0 || subnetProbeHost == 255) subnetProbeHost = 2;
    IPAddress candidate(local[0], local[1], local[2], subnetProbeHost);
    subnetProbeHost++;
    tried++;
    if ((uint32_t)candidate == (uint32_t)local ||
        (uint32_t)candidate == (uint32_t)gateway) {
      continue;
    }
    if (tryProxyCandidate(candidate, "subnet")) return true;
  }

  return false;
}

#if !DISABLE_PROXY_UART
static uint8_t checksum8(const char *text) {
  uint8_t sum = 0;
  if (!text) return 0;
  while (*text) {
    sum ^= (uint8_t)*text++;
  }
  return sum;
}

static void startProxyUart() {
  if (proxyUartMutex == NULL) {
    proxyUartMutex = xSemaphoreCreateMutex();
  }
  if (proxyUartStarted) return;
  pinMode(PROXY_UART_RX, INPUT_PULLUP);
  pinMode(PROXY_UART_TX, OUTPUT);
  digitalWrite(PROXY_UART_TX, HIGH);
  proxySerial.begin(PROXY_UART_BAUD, SERIAL_8N1, PROXY_UART_RX, PROXY_UART_TX);
  proxySerial.setTimeout(PROXY_UART_TIMEOUT_MS);
  proxyUartStarted = true;
  Serial.printf("[PROXY-UART] Serial1 ready RX=%d TX=%d baud=%d\n",
                PROXY_UART_RX, PROXY_UART_TX, PROXY_UART_BAUD);
}

static void resetProxyUart(const char *reason) {
  Serial.printf("[PROXY-UART] Resetting Serial1 (%s)\n",
                reason ? reason : "unknown");
  proxySerial.end();
  vTaskDelay(pdMS_TO_TICKS(20));
  pinMode(PROXY_UART_RX, INPUT_PULLUP);
  pinMode(PROXY_UART_TX, OUTPUT);
  digitalWrite(PROXY_UART_TX, HIGH);
  proxySerial.begin(PROXY_UART_BAUD, SERIAL_8N1, PROXY_UART_RX, PROXY_UART_TX);
  proxySerial.setTimeout(PROXY_UART_TIMEOUT_MS);
  while (proxySerial.available()) proxySerial.read();
}

static bool proxyUartRequest(const char *method, const char *path,
                             const char *payload, String &bodyOut,
                             unsigned long timeoutMs = PROXY_UART_TIMEOUT_MS) {
  startProxyUart();
  bool haveMutex = false;
  if (proxyUartMutex != NULL) {
    haveMutex = (xSemaphoreTake(proxyUartMutex,
                                pdMS_TO_TICKS(timeoutMs + 250UL)) == pdTRUE);
    if (!haveMutex) {
      Serial.printf("[PROXY-UART] Busy timeout %s %s\n",
                    method ? method : "GET", path ? path : "/");
      return false;
    }
  }
  while (proxySerial.available()) proxySerial.read();

  bool canRetry = (method != NULL && strcmp(method, "GET") == 0);
  uint8_t attempts = canRetry ? PROXY_UART_GET_RETRIES : 1;
  if (attempts < 1) attempts = 1;

