LorenzoBela/Ard-IDE/8_Controller_ESP32_Hotspot_FastGeo/ProxyClient.cpp
  uint16_t lastId = 0;
  uint16_t totalRxBytes = 0;
  uint8_t totalBadChecksum = 0;
  uint8_t totalWrongId = 0;
  uint8_t totalMalformed = 0;
  char firstLine[96] = "";

  for (uint8_t attempt = 1; attempt <= attempts; attempt++) {
    uint16_t id = proxyRequestId++;
    if (proxyRequestId == 0) proxyRequestId = 1;
    lastId = id;

    char frame[760];
    snprintf(frame, sizeof(frame), "REQ|%u|%s|%s|%s",
             (unsigned int)id, method ? method : "GET", path ? path : "/",
             payload ? payload : "");
    uint8_t sum = checksum8(frame);
    proxySerial.printf("%s|%02X\n", frame, sum);
    proxySerial.flush();

    unsigned long deadline = millis() + timeoutMs;
    char line[900];
    uint16_t len = 0;

    while (millis() < deadline) {
      while (proxySerial.available()) {
        char c = (char)proxySerial.read();
        totalRxBytes++;
        if (c == '\r') continue;
        if (c == '\n') {
          line[len] = '\0';
          len = 0;

          String resp(line);
          if (firstLine[0] == '\0') {
            strncpy(firstLine, line, sizeof(firstLine) - 1);
            firstLine[sizeof(firstLine) - 1] = '\0';
          }
          if (!resp.startsWith("RESP|")) {
            totalMalformed++;
            continue;
          }
          int p1 = resp.indexOf('|', 5);
          int p2 = (p1 >= 0) ? resp.indexOf('|', p1 + 1) : -1;
          int p3 = (p2 >= 0) ? resp.lastIndexOf('|') : -1;
          if (p1 < 0 || p2 < 0 || p3 <= p2) {
            totalMalformed++;
            continue;
          }

          uint16_t respId = (uint16_t)resp.substring(5, p1).toInt();
          if (respId != id) {
            totalWrongId++;
            continue;
          }

          String withoutCrc = resp.substring(0, p3);
          uint8_t expected = (uint8_t)strtoul(resp.substring(p3 + 1).c_str(), NULL, 16);
          if (checksum8(withoutCrc.c_str()) != expected) {
            totalBadChecksum++;
            Serial.println(F("[PROXY-UART] Ignored bad checksum"));
            continue;
          }

          int status = resp.substring(p1 + 1, p2).toInt();
          bodyOut = resp.substring(p2 + 1, p3);
          Serial.printf("[PROXY-UART] Response id=%u status=%d len=%u attempt=%u\n",
                        (unsigned int)id, status,
                        (unsigned int)bodyOut.length(), (unsigned int)attempt);
          proxyUartResetCount = 0;
          if (haveMutex) xSemaphoreGive(proxyUartMutex);
          return status >= 200 && status < 300;
        }
        if (len < sizeof(line) - 1) {
          line[len++] = c;
        } else {
          len = 0;
        }
      }
      yield();
    }

    if (attempt < attempts) {
      vTaskDelay(pdMS_TO_TICKS(30));
      while (proxySerial.available()) proxySerial.read();
    }
  }

  Serial.printf("[PROXY-UART] Timeout id=%u %s %s attempts=%u rxBytes=%u badCrc=%u wrongId=%u malformed=%u first='%s'\n",
                (unsigned int)lastId, method ? method : "GET", path ? path : "/",
                (unsigned int)attempts, (unsigned int)totalRxBytes,
                (unsigned int)totalBadChecksum, (unsigned int)totalWrongId,
                (unsigned int)totalMalformed, firstLine);

  if (totalRxBytes == 0 || totalBadChecksum > 0 || totalMalformed > 1) {
    if (proxyUartResetCount < 255) proxyUartResetCount++;
    if (proxyUartResetCount >= 3) {
      resetProxyUart(totalRxBytes == 0 ? "no_rx" : "bad_frames");
      proxyUartResetCount = 0;
    }
  }
  if (haveMutex) xSemaphoreGive(proxyUartMutex);
  return false;
}

static bool proxyUartPrimaryRequest(const char *method, const char *path,
                                    const char *payload, String &bodyOut,
                                    unsigned long timeoutMs,
                                    bool force = false) {
  unsigned long now = millis();
  if (!force && now < proxyUartRetryAt) {
    return false;
  }

  if (proxyUartRequest(method, path, payload, bodyOut, timeoutMs)) {
    proxyUartRetryAt = 0;
    proxyUartFailCount = 0;
    return true;
  }

  if (proxyUartFailCount < 20) {
    proxyUartFailCount++;
  }
  unsigned long cooldown = 5000UL + ((unsigned long)proxyUartFailCount * 500UL);
  if (cooldown > 10000UL) {
    cooldown = 10000UL;
  }
  proxyUartRetryAt = now + cooldown;
  return false;
}
#else
static void startProxyUart() {}

static void resetProxyUart(const char *reason) {
  (void)reason;
}

static bool proxyUartRequest(const char *method, const char *path,
                             const char *payload, String &bodyOut,
                             unsigned long timeoutMs = 0) {
  (void)method;
  (void)path;
  (void)payload;
  (void)bodyOut;
  (void)timeoutMs;
  return false;
}

static bool proxyUartPrimaryRequest(const char *method, const char *path,
                                    const char *payload, String &bodyOut,
                                    unsigned long timeoutMs,
                                    bool force = false) {
  (void)method;
  (void)path;
  (void)payload;
  (void)bodyOut;
  (void)timeoutMs;
  (void)force;
  return false;
}
#endif

static bool discoverProxyUdp(unsigned long timeoutMs = 1200) {
  if (WiFi.status() != WL_CONNECTED) return false;

  WiFiUDP discovery;
  // Use a fixed receive port. Some phone hotspots pass broadcast discovery
  // but drop replies to random high UDP source ports.
  if (!discovery.begin(PROXY_DISCOVERY_PORT)) {
    Serial.printf("[DISCOVERY] UDP begin(%d) failed\n", PROXY_DISCOVERY_PORT);
    return false;
  }

  IPAddress broadcast((uint32_t)WiFi.localIP() | ~(uint32_t)WiFi.subnetMask());

  unsigned long deadline = millis() + timeoutMs;
  char packet[96];
  unsigned long nextQueryAt = 0;
  while (millis() < deadline) {
    unsigned long now = millis();
    if (now >= nextQueryAt) {
      discovery.beginPacket(broadcast, PROXY_DISCOVERY_PORT);
      discovery.print(PROXY_DISCOVERY_QUERY);
      discovery.endPacket();
      nextQueryAt = now + 250;
    }

    int size = discovery.parsePacket();
    if (size > 0) {
      int len = discovery.read(packet, sizeof(packet) - 1);
      if (len < 0) len = 0;
      packet[len] = '\0';
      if (strncmp(packet, PROXY_DISCOVERY_REPLY,
                  strlen(PROXY_DISCOVERY_REPLY)) == 0) {
        const char *payload = packet + strlen(PROXY_DISCOVERY_REPLY);
        char replyIp[16] = "";
        int replyPort = PROXY_PORT;
        char replyHardware[12] = "";

        int parsed = sscanf(payload, "%15[^:]:%d:%11s",
                            replyIp, &replyPort, replyHardware);
        IPAddress ip;
        if (parsed >= 1 && ip.fromString(replyIp)) {
          rememberDiscoveredProxy(ip, parsed >= 3 ? replyHardware : NULL, "udp");
        } else {
          ip = discovery.remoteIP();
          rememberDiscoveredProxy(ip, parsed >= 3 ? replyHardware : NULL, "udp_remote");
        }
        Serial.printf("[DISCOVERY] Proxy at %s:%d (%s)\n",
                      PROXY_HOST, replyPort, packet);
        discovery.stop();
        return true;
      }
    }
    delay(20);
  }
  discovery.stop();
  if (proxyDiscoveryMisses < 255) proxyDiscoveryMisses++;
  Serial.printf("[DISCOVERY] Proxy discovery timed out (%u)\n",
                proxyDiscoveryMisses);
  if (proxyDiscoveryMisses >= 3 && millis() >= nextProxySubnetProbeAt) {
    nextProxySubnetProbeAt = millis() + 3000UL;
    Serial.println(F("[DISCOVERY] UDP failed; probing likely proxy IPs"));
    if (probeLikelyProxyHosts()) {
      return true;
    }
  }
  return false;
}

// ── Fetch reliability controls ──
static const uint16_t FETCH_HTTP_TIMEOUT_MS = 5000;
static const uint16_t REFRESH_HTTP_TIMEOUT_MS = 2500;
static unsigned long lastFetchSuccessAt = 0;
static uint8_t fetchFailCount = 0;
static const uint8_t FETCH_FAIL_RESET_THRESHOLD = 20;

static void hardResetDeliveryContext(const char *reason) {
  if (!hasActiveDelivery && currentOtp[0] == '\0' && activeDeliveryId[0] == '\0' &&
      lastStatusCommand.length() == 0) {
    return;
  }

  currentOtp[0] = '\0';
  activeDeliveryId[0] = '\0';
  hasActiveDelivery = false;
  lastStatusCommand = "";
  geoDistMeters = -1;
  geoInsideFence = false;
  isReturning = false;
  strncpy(deliveryPhase, "NONE", sizeof(deliveryPhase) - 1);
  deliveryPhase[sizeof(deliveryPhase) - 1] = '\0';
  pickupInsideFence = false;
  dropoffInsideFence = false;
  netLog("[FETCH] Hard reset delivery context (%s)\n",
         reason ? reason : "unknown");
}

static void noteFetchFailure(const char *stage) {
  if (fetchFailCount < 255) {
    fetchFailCount++;
  }

  netLog("[FETCH] %s failed (%u/%u)\n",
         stage ? stage : "request",
         fetchFailCount,
         FETCH_FAIL_RESET_THRESHOLD);

  if (fetchFailCount < FETCH_FAIL_RESET_THRESHOLD) {
    return;
  }

  unsigned long now = millis();
  bool hasFreshContext =
      hasActiveDelivery &&
      lastFetchSuccessAt > 0 &&
      (now - lastFetchSuccessAt) <= FETCH_CONTEXT_STICKY_MS;

  if (hasFreshContext) {
    netLog("[FETCH] Preserving cached delivery during WiFi blip (%lums old)\n",
           now - lastFetchSuccessAt);
    fetchFailCount = FETCH_FAIL_RESET_THRESHOLD / 2;
    return;
  }

  fetchFailCount = 0;
  hardResetDeliveryContext(stage);
}

static String normalizeStatusToken(const String &rawToken) {
  String token = rawToken;
  token.trim();

  // Some upstream paths may include JSON quotes around text values.
  if (token.length() >= 2 && token[0] == '"' && token[token.length() - 1] == '"') {
    token = token.substring(1, token.length() - 1);
    token.trim();
  }

  if (token == "UNLOCKING" || token == "LOCKED" || token == "REBOOT_ALL") {
    return token;
  }

