LorenzoBela/Ard-IDE/8_Controller_ESP32_Hotspot_FastGeo/ProxyClient.cpp
  if (now >= wifiRescanAt || WIFI_SSID[0] == '\0') {
    netLog("[WIFI] Lost link; rescanning AP list...\n");
    scanForProxy();
    wifiRescanAt = now + WIFI_RESCAN_INTERVAL_MS;
  }

  if (now < wifiRetryAt) return;

  netLog("[WIFI] Retry (backoff %lums)...\n", wifiBackoffMs);
  closePersistentConnection(); // Kill stale TCP before WiFi reset
  clearDiscoveredProxy("wifi_retry");
  advanceHotspotCandidate("connect_failed");
  if (wifiReconnectAttempts >= 3) {
    WiFi.disconnect();
  }
  scanForProxy();
  beginProxyConnection("retry");

  unsigned long jitter = (unsigned long)random(0, WIFI_RETRY_JITTER_MS + 1);
  wifiRetryAt = now + wifiBackoffMs + jitter;
  if (wifiBackoffMs < WIFI_RETRY_MAX_MS) {
    wifiBackoffMs *= 2;
    if (wifiBackoffMs > WIFI_RETRY_MAX_MS) {
      wifiBackoffMs = WIFI_RETRY_MAX_MS;
    }
  }
}

// ── Persistent connection for high-frequency /otp polling ──
// Reusing the TCP socket across polls eliminates ~100-200ms of
// TCP handshake overhead per request on the local SoftAP link.
static WiFiClient persistentClient;
static bool       persistentConnected = false;

static void closePersistentConnection() {
  if (persistentConnected) {
    persistentClient.stop();
    persistentConnected = false;
  }
}

static bool ensurePersistentConnection() {
  if (persistentConnected && persistentClient.connected()) {
    return true;
  }
  if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(700) &&
      !probeLikelyProxyHosts(10)) {
    netLog("[FETCH] Proxy discovery failed\n");
    return false;
  }
  // Tear down stale socket before reconnecting.
  persistentClient.stop();
  persistentConnected = false;

  persistentClient.setTimeout(FETCH_HTTP_TIMEOUT_MS / 1000); // seconds
  if (!persistentClient.connect(PROXY_HOST, PROXY_PORT)) {
    netLog("[FETCH] TCP connect failed\n");
    clearDiscoveredProxy("tcp_connect_failed");
    return false;
  }
  persistentConnected = true;
  return true;
}

static int httpGetOnce(const char *path, String &bodyOut,
                       unsigned long timeoutMs = FETCH_HTTP_TIMEOUT_MS) {
  bodyOut = "";
  if (WiFi.status() != WL_CONNECTED) return -1;
  if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(700) &&
      !probeLikelyProxyHosts(10)) {
    return -1;
  }

  WiFiClient client;
  client.setTimeout(timeoutMs / 1000);
  Serial.printf("[HTTP] GET http://%s:%d%s\n", PROXY_HOST, PROXY_PORT, path);
  Serial.flush();
  if (!client.connect(PROXY_HOST, PROXY_PORT)) {
    Serial.println(F("[HTTP] TCP connect failed"));
    Serial.flush();
    clearDiscoveredProxy("http_connect_failed");
    return -1;
  }

  client.printf(
      "GET %s HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "Connection: close\r\n"
      "\r\n",
      path, PROXY_HOST, PROXY_PORT);

  unsigned long deadline = millis() + timeoutMs;
  int statusCode = -1;
  int contentLength = -1;
  bool headersDone = false;

  while (millis() < deadline) {
    if (!client.connected() && !client.available()) break;
    if (!client.available()) {
      yield();
      continue;
    }
    String line = client.readStringUntil('\n');
    line.trim();
    if (statusCode < 0) {
      if (line.startsWith("HTTP/")) {
        int spaceIdx = line.indexOf(' ');
        if (spaceIdx > 0) statusCode = line.substring(spaceIdx + 1).toInt();
      }
      continue;
    }
    if (line.length() == 0) {
      headersDone = true;
      break;
    }
    if (line.startsWith("Content-Length:") || line.startsWith("content-length:")) {
      contentLength = line.substring(line.indexOf(':') + 1).toInt();
    }
  }

  if (!headersDone || statusCode < 0) {
    client.stop();
    Serial.println(F("[HTTP] No complete response headers"));
    Serial.flush();
    return -1;
  }

  if (contentLength >= 0) {
    while ((int)bodyOut.length() < contentLength && millis() < deadline) {
      if (client.available()) {
        bodyOut += (char)client.read();
      } else {
        yield();
      }
    }
  } else {
    while (millis() < deadline && (client.connected() || client.available())) {
      if (client.available()) {
        bodyOut += (char)client.read();
      } else if (bodyOut.length() > 0) {
        break;
      } else {
        yield();
      }
    }
  }
  client.stop();
  bodyOut.trim();
  Serial.printf("[HTTP] status=%d body='%s'\n", statusCode, bodyOut.c_str());
  Serial.flush();
  return statusCode;
}

/** Read one complete HTTP response from the persistent socket.
 *  Returns the HTTP status code (e.g. 200), or -1 on error.
 *  Writes the response body into bodyOut. */
static int readHttpResponse(String &bodyOut, unsigned long timeoutMs) {
  unsigned long deadline = millis() + timeoutMs;
  int statusCode = -1;
  int contentLength = -1;
  bool headersDone = false;
  bodyOut = "";

  // ── Read status line + headers ──
  while (millis() < deadline) {
    if (!persistentClient.connected() && !persistentClient.available()) return -1;
    if (!persistentClient.available()) {
      yield();
      continue;
    }
    String line = persistentClient.readStringUntil('\n');
    line.trim();

    if (statusCode < 0) {
      // Parse "HTTP/1.1 200 OK"
      if (line.startsWith("HTTP/")) {
        int spaceIdx = line.indexOf(' ');
        if (spaceIdx > 0) {
          statusCode = line.substring(spaceIdx + 1).toInt();
        }
      }
      continue;
    }

    if (line.length() == 0) {
      headersDone = true;
      break;
    }

    // Parse Content-Length header
    if (line.startsWith("Content-Length:") || line.startsWith("content-length:")) {
      contentLength = line.substring(line.indexOf(':') + 1).toInt();
    }
  }

  if (!headersDone || statusCode < 0) return -1;

  // ── Read body ──
  if (contentLength > 0) {
    char buf[256];
    int toRead = (contentLength < (int)sizeof(buf) - 1) ? contentLength : (int)sizeof(buf) - 1;
    int rd = 0;
    while (rd < toRead && millis() < deadline) {
      if (persistentClient.available()) {
        buf[rd++] = persistentClient.read();
      } else {
        yield();
      }
    }
    buf[rd] = '\0';
    bodyOut = String(buf);
  } else if (contentLength == 0) {
    bodyOut = "";
  } else {
    // No Content-Length header — read until timeout or connection close.
    // This is a fallback; the proxy should always send Content-Length.
    while (millis() < deadline && persistentClient.connected()) {
      if (persistentClient.available()) {
        bodyOut += (char)persistentClient.read();
      } else {
        // Brief idle gap — if we already have data, assume body is done.
        if (bodyOut.length() > 0) break;
        yield();
      }
    }
  }

  return statusCode;
}

