LorenzoBela/Ard-IDE/8_Controller_ESP32_Hotspot_FastGeo/ProxyClient.cpp
bool requestContextRefresh() {
  String uartBody;

  if (WiFi.status() != WL_CONNECTED) {
    closePersistentConnection();
    if (proxyUartPrimaryRequest("GET", "/refresh-context", "", uartBody,
                                PROXY_UART_TIMEOUT_MS)) {
      uartBody.trim();
      netLog("[REFRESH] UART fallback body='%s'\n", uartBody.c_str());
      return uartBody.startsWith("OK");
    }
    netLog("[REFRESH] Skip — no primary transport available\n");
    return false;
  }

#if DISABLE_PROXY_KEEPALIVE
  String body = "";
  int code = httpGetOnce("/refresh-context?geo=1", body, FETCH_HTTP_TIMEOUT_MS);
  body.trim();
  netLog("[REFRESH] HTTP %d body='%s'\n", code, body.c_str());
  if (code == 200 && body.startsWith("OK")) {
    return true;
  }
  return false;
#else
  if (!ensurePersistentConnection()) {
    netLog("[REFRESH] TCP connect failed\n");
    return false;
  }

  persistentClient.printf(
      "GET /refresh-context?geo=1 HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "Connection: keep-alive\r\n"
      "\r\n",
      PROXY_HOST, PROXY_PORT);

  String body = "";
  int code = readHttpResponse(body, FETCH_HTTP_TIMEOUT_MS);
  if (code < 0) {
    netLog("[REFRESH] Read failed — reconnecting\n");
    closePersistentConnection();
    if (!ensurePersistentConnection()) {
      netLog("[REFRESH] TCP retry failed\n");
      return false;
    }
    persistentClient.printf(
        "GET /refresh-context?geo=1 HTTP/1.1\r\n"
        "Host: %s:%d\r\n"
        "Connection: keep-alive\r\n"
        "\r\n",
        PROXY_HOST, PROXY_PORT);
    body = "";
    code = readHttpResponse(body, FETCH_HTTP_TIMEOUT_MS);
    if (code < 0) {
      netLog("[REFRESH] Retry failed\n");
      closePersistentConnection();
      return false;
    }
  }

  body.trim();
  netLog("[REFRESH] HTTP %d body='%s'\n", code, body.c_str());
  if (code == 200 && body.startsWith("OK")) {
    return true;
  }
  return false;
#endif
}

bool requestProxyPing() {
  String uartBody;

  if (WiFi.status() != WL_CONNECTED) {
    closePersistentConnection();
    if (proxyUartPrimaryRequest("GET", "/ping", "", uartBody, PROXY_UART_TIMEOUT_MS)) {
      uartBody.trim();
      return uartBody.startsWith("OK");
    }
    return false;
  }

#if DISABLE_PROXY_KEEPALIVE
  String body = "";
  int code = httpGetOnce("/ping", body, 1000);
  body.trim();
  if (code == 200 && body.startsWith("OK")) {
    return true;
  }
  return false;
#else
  if (!ensurePersistentConnection()) {
    return false;
  }

  persistentClient.printf(
      "GET /ping HTTP/1.1\r\n"
      "Host: %s:%d\r\n"
      "Connection: keep-alive\r\n"
      "\r\n",
      PROXY_HOST, PROXY_PORT);

  String body = "";
  int code = readHttpResponse(body, 1000);
  if (code < 0) {
    closePersistentConnection();
    return false;
  }

  body.trim();
  if (code == 200 && body.startsWith("OK")) {
    return true;
  }
  return false;
#endif
}

bool fetchDiagnostics(ControllerDiagData &out) {
  String uartDiagBody;
  if (WiFi.status() != WL_CONNECTED) {
    if (proxyUartRequest("GET", "/diag", "", uartDiagBody, CONTROLLER_DIAG_HTTP_TIMEOUT_MS + 800)) {
      String field;
      ControllerDiagData parsed = out;
      bool parsedAny = false;

      if (parseDiagField(uartDiagBody, "batt_pct", field)) { parsed.battPct = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "batt_v", field)) { parsed.battVoltage = field.toFloat(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "rssi", field)) { parsed.rssi = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "csq", field)) { parsed.csq = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "gps_fix", field)) { parsed.gpsFix = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "lte", field)) { parsed.lteConnected = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "modem", field)) { parsed.modemOk = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "time", field)) { parsed.timeSynced = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "cam_up", field)) { parsed.camUp = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "ctrl_up", field)) { parsed.controllerUp = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "fb_fail", field)) { parsed.firebaseFailures = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "cmd_stage", field)) { parsed.commandStage = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "cmd_pending", field)) { parsed.commandPending = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "conn_state", field)) { parsed.connectivityState = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "lte_reconn_ms", field)) { parsed.lteReconnectMs = (unsigned long)field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "upload_active", field)) { parsed.photoUploadActive = (field.toInt() != 0); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "upload_pct", field)) { parsed.photoUploadProgress = field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "upload_age", field)) { parsed.photoUploadAgeMs = (unsigned long)field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "cam_age", field)) { parsed.camAgeMs = (unsigned long)field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "ctrl_age", field)) { parsed.controllerAgeMs = (unsigned long)field.toInt(); parsedAny = true; }
      if (parseDiagField(uartDiagBody, "uptime", field)) { parsed.proxyUptimeMs = (unsigned long)field.toInt(); parsedAny = true; }
      if (parsedAny) {
        out = parsed;
        return true;
      }
    }
    return false;
  }
  if (PROXY_HOST[0] == '\0' && !discoverProxyUdp(700) &&
      !probeLikelyProxyHosts(8)) return false;

  WiFiClient client;
  HTTPClient http;
  char url[64];
  snprintf(url, sizeof(url), "http://%s:%d/diag", PROXY_HOST, PROXY_PORT);

  http.setTimeout(CONTROLLER_DIAG_HTTP_TIMEOUT_MS);
  http.setReuse(false);
  http.begin(client, url);

